#!/bin/bash
################################################################################
#   Copyright (c) Renleilei_Johnny.github, All Rights Reserved
#	
#   文件名称: Main__.sh
#	文件说明: 主要的脚本技巧会加入到这个脚本中
#	版本说明: V1.0.0
################################################################################


#------------------- xxxx 工具脚本 -----------------------#
#     Author   : Renleilei                                #
#     Date     :



## 使用 TimeLog() 记录时间
TimeLog()
{
	iTime=`date +%Y%m%d-%H:%M:%S`
	echo "[$iTime]:$1" $2
}

## 去除空行
trim()
{
	echo $1 | sed 's/^ \+//' | sed 's/ \+$//'
}

